document.addEventListener("DOMContentLoaded", () => {
  const duas = [
    "‏اللَّهُمَّ إنِّي أَسْأَلُك مِنْ فَضْلِكَ وَرَحْمَتِكَ فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتْ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَوَسِّعْ لِي فِي دَارِي وَبَارِكْ لِي فِي رِزْقِي",
    "ا‏للهم يا من تملك حوائج السائلين وتعلم ضمائر الصامتين ارزقنا وكل مسلم سروراً لا يرى به حزن وسعادةً لا يعكرها شقاء وعافيةً لا تزول",
    "ا‏للهم يا من تملك حوائج السائلين وتعلم ضمائر الصامتين ارزقنا وكل مسلم سروراً لا يرى به حزن وسعادةً لا يعكرها شقاء وعافيةً لا تزول",
    "اللهم في يوم الجمعة ارزقنا حياة سعيدة، رفقة صالحة، رزق مبارك، أدعية مستجابة، امنيات محققة، الفردوس الاعلى لي ولمن أحب",
    "اللهم اغفر لي ولأبي ولأمي ولإخواني ولأصدقائي",
    "اللهم اجعلنا من أهل الجنة",
    "‏ربي إن ابتليتني فاجعلني عبدًا صبورًا وإن أنعمت علي فاجعلني عبدًا شكورًا.",
    "‏اللهم طهر قلوبنا من النفاق ومن الغل ومن الحقد والحسد وأعمالنا من الرياء وألسنتنا من الكذب وجوارحنا من الخيانة، اللهم حبب إلينا الإيمان وزينه في قلوبنا وكره إلينا الكفر والفسوق والعصيان، واصرف عنا البلاء والوباء وسائر الأسقام. آمين يا رب العالمين",
    ,"الهم اتنا في الدنيا حسنا وفي الاخرة حسنة وقناة عذاب النار ",
];




    const duasContainer = document.getElementById("duas-container");

    duas.forEach((dua) => {
        const duaDiv = document.createElement("div");
        duaDiv.classList.add("dua");
        duaDiv.innerHTML = `<p>${dua}</p>`;
        duasContainer.appendChild(duaDiv);
    });
});
